# Это может быть абсолютно любая автоматизация на Python: начиная с того, что вы
# давно хотели автоматизировать на работе, заканчивая тем, что вам хочется создать
# какой-то инструмент для себя или ваших коллег.
#
# Это может быть свой оператор для Kubernetes, свой модуль или плагин для Ansible,
# это может быть расширение любой другой системы вне изученных в рамках курса модулей
# и технологий. Также часто применяются линтеры кастомных описаний ресурсов IaC.
# Большие перспективы открыты в сфере chatops в виде переноса "панели управления"
# ресурсами в общие чаты.
#
# Сложность проекта не ограничена. Всем участникам, активно участвовавших в решении
# курсовых кейсов будут выданы безномерные сертификаты о прослушивании курса
# (без внесения в реестр).